### Report for environment: 

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.61.0...
- Installed hashicorp/aws v5.61.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (25 to add, 6 to change, 0 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.bulk_ods_update_lambda_cloudwatch_log_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bulk_ods_update_lambda_cloudwatch_log_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "CloudwatchLogs"
        }
    }

  # aws_cloudwatch_event_rule.ods_bulk_update_schedule will be created
  + resource "aws_cloudwatch_event_rule" "ods_bulk_update_schedule" {
      + arn                 = (known after apply)
      + description         = "Schedule for ODS Update Lambda"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dev_ods_bulk_update_schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 1 ? * 1 *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.ods_bulk_update_schedule_event will be created
  + resource "aws_cloudwatch_event_target" "ods_bulk_update_schedule_event" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "dev_ods_bulk_update_schedule"
      + target_id      = "ods_bulk_update_schedule"
    }

  # aws_cloudwatch_log_group.bulk_ods_update_lambda will be created
  + resource "aws_cloudwatch_log_group" "bulk_ods_update_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/dev-ods_bulk_update_lambda"
      + name_prefix       = (known after apply)
      + retention_in_days = 60
      + skip_destroy      = false
      + tags              = {
          + "ApplicationRole"     = "AwsCloudwatchLogGroup"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "prm-gp-registrations-mi-infra"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-ods_bulk_update_lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all          = {
          + "ApplicationRole"     = "AwsCloudwatchLogGroup"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "prm-gp-registrations-mi-infra"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-ods_bulk_update_lambda"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
    }

  # aws_dynamodb_table.mi_api_gp_ods will be created
  + resource "aws_dynamodb_table" "mi_api_gp_ods" {
      + arn                         = (known after apply)
      + billing_mode                = "PAY_PER_REQUEST"
      + deletion_protection_enabled = true
      + hash_key                    = "PracticeOdsCode"
      + id                          = (known after apply)
      + name                        = "dev_mi_enrichment_practice_ods"
      + read_capacity               = (known after apply)
      + stream_arn                  = (known after apply)
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "mi_enrichment_practice_ods"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "mi_enrichment_practice_ods"
        }
      + write_capacity              = (known after apply)

      + attribute {
          + name = "PracticeOdsCode"
          + type = "S"
        }

      + import_table {
          + input_compression_type = "NONE"
          + input_format           = "CSV"

          + input_format_options {
              + csv {
                  + delimiter = ","
                }
            }

          + s3_bucket_source {
              + bucket     = (known after apply)
              + key_prefix = "init/initial-gps-ods-csv"
            }
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.mi_api_icb_ods will be created
  + resource "aws_dynamodb_table" "mi_api_icb_ods" {
      + arn                         = (known after apply)
      + billing_mode                = "PAY_PER_REQUEST"
      + deletion_protection_enabled = true
      + hash_key                    = "IcbOdsCode"
      + id                          = (known after apply)
      + name                        = "dev_mi_enrichment_icb_ods"
      + read_capacity               = (known after apply)
      + stream_arn                  = (known after apply)
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "mi_enrichment_icb_ods"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "mi_enrichment_icb_ods"
        }
      + write_capacity              = (known after apply)

      + attribute {
          + name = "IcbOdsCode"
          + type = "S"
        }

      + import_table {
          + input_compression_type = "NONE"
          + input_format           = "CSV"

          + input_format_options {
              + csv {
                  + delimiter = ","
                }
            }

          + s3_bucket_source {
              + bucket     = (known after apply)
              + key_prefix = "init/initial-icb-ods-csv"
            }
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_iam_policy.bulk_ods_update_lambda_cloudwatch_log_access will be created
  + resource "aws_iam_policy" "bulk_ods_update_lambda_cloudwatch_log_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-bulk-ods-update-lambda-log-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.dynamodb_policy_bulk_icb_ods_data_lambda will be created
  + resource "aws_iam_policy" "dynamodb_policy_bulk_icb_ods_data_lambda" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dynamodb_dev_mi_enrichment_icb_ods_bulk_update_lambda_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.dynamodb_policy_bulk_ods_data_lambda will be created
  + resource "aws_iam_policy" "dynamodb_policy_bulk_ods_data_lambda" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dynamodb_dev_mi_enrichment_practice_ods_bulk_update_lambda_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.dynamodb_policy_icb_ods_enrichment_lambda will be created
  + resource "aws_iam_policy" "dynamodb_policy_icb_ods_enrichment_lambda" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dynamodb_dev_mi_enrichment_icb_ods_enrichment_lambda_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.dynamodb_policy_ods_enrichment_lambda will be created
  + resource "aws_iam_policy" "dynamodb_policy_ods_enrichment_lambda" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dynamodb_dev_mi_enrichment_practice_ods_enrichment_lambda_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.ods_csv_files_data_policy will be created
  + resource "aws_iam_policy" "ods_csv_files_data_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-ods-csv-files_get_document_data_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.bulk_ods_lambda will be created
  + resource "aws_iam_role" "bulk_ods_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-bulk-ods-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.event_enrichment_lambda_role will be updated in-place
  ~ resource "aws_iam_role" "event_enrichment_lambda_role" {
        id                    = "dev-event-enrichment-lambda-role"
      ~ managed_policy_arns   = [
          - "arn:aws:iam::343515223843:policy/dev-enriched-mi-events-sns-publish-access",
          - "arn:aws:iam::343515223843:policy/dev-event-enricher-lambda-log-access",
          - "arn:aws:iam::343515223843:policy/dev-event-enrichment-lambda-send-to-dlq-access",
          - "arn:aws:iam::343515223843:policy/dev-event-enrichment-lambda-ssm-access",
          - "arn:aws:iam::343515223843:policy/dev-incoming-mi-events-enrichment-lambda-sqs-read",
        ] -> (known after apply)
        name                  = "dev-event-enrichment-lambda-role"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_event_source_mapping.sqs_queue_event_enrichment_lambda_trigger will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "sqs_queue_event_enrichment_lambda_trigger" {
        id                                 = "69bc334b-e82e-434a-93e2-eee5b6df2cce"
        # (21 unchanged attributes hidden)

      + filter_criteria {
          + filter {
              + pattern = jsonencode(
                    {
                      + body = {
                          + eventType = [
                              + {
                                  + anything-but = [
                                      + "DEGRADES",
                                    ]
                                },
                            ]
                        }
                    }
                )
            }
        }
    }

  # aws_lambda_function.error_alarm_alert_lambda will be updated in-place
  ~ resource "aws_lambda_function" "error_alarm_alert_lambda" {
      ~ filename                       = "/dojo/work/lambda/build/error-alarm-alert.zip" -> "/home/runner/work/prm-gp-registrations-mi-infra/prm-gp-registrations-mi-infra/stacks/gp-registrations-mi/terraform/../../../lambda/build/error-alarm-alert.zip"
        id                             = "dev-error-alarm-alert-lambda"
      ~ last_modified                  = "2024-01-30T14:18:01.000+0000" -> (known after apply)
      ~ runtime                        = "python3.9" -> "python3.12"
      ~ source_code_hash               = "lBPLpdLM/PAtd5wZ+vYSGomkuasRqUTgq3hTd+SUeEQ=" -> "x7jWiqK/ftskbQgQNFuT7EnPZ9uB++vVtYumwkC3Ku0="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "prm-gp-registrations-mi-infra"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-error-alarm-alerts-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.event_enrichment_lambda will be updated in-place
  ~ resource "aws_lambda_function" "event_enrichment_lambda" {
      ~ filename                       = "/dojo/work/lambda/build/event-enrichment.zip" -> "/home/runner/work/prm-gp-registrations-mi-infra/prm-gp-registrations-mi-infra/stacks/gp-registrations-mi/terraform/../../../lambda/build/event-enrichment.zip"
        id                             = "dev-event-enrichment-lambda"
      ~ last_modified                  = "2024-01-30T14:18:12.000+0000" -> (known after apply)
      ~ layers                         = [] -> (known after apply)
      ~ runtime                        = "python3.9" -> "python3.12"
      ~ source_code_hash               = "zwYpWEIHCiAZKHa3C3McCE80fitUNwkA7rCErWLZGng=" -> "CvnQD2VXmXfPS68DboG78XWcm4YVp3PkmfNkJJt43s8="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "prm-gp-registrations-mi-infra"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-gp-registrations-mi"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (24 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "GP_ODS_DYNAMO_TABLE_NAME"                  = "dev_mi_enrichment_practice_ods"
              + "ICB_ODS_DYNAMO_TABLE_NAME"                 = "dev_mi_enrichment_icb_ods"
                # (4 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ods_bulk_update will be created
  + resource "aws_lambda_function" "ods_bulk_update" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "ods_bulk_update_lambda"
      + function_name                  = "dev-ods_bulk_update_lambda"
      + handler                        = "ods_bulk_update.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "lO9WEvaJuYP7UltTs4rOL0Tzxm/iNPPPYFFUEJPCQpc="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "ApplicationRole"     = "AwsLambdaFunction"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "prm-gp-registrations-mi-infra"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-gp-mi-ods-bulk"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                       = {
          + "ApplicationRole"     = "AwsLambdaFunction"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "prm-gp-registrations-mi-infra"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-gp-mi-ods-bulk"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "GP_ODS_DYNAMO_TABLE_NAME"     = "dev_mi_enrichment_practice_ods"
              + "ICB_ODS_DYNAMO_TABLE_NAME"    = "dev_mi_enrichment_icb_ods"
              + "ODS_S3_BUCKET_NAME"           = "dev-ods-csv-files"
              + "TRUD_API_KEY_PARAM_NAME"      = (sensitive value)
              + "TRUD_FHIR_API_URL_PARAM_NAME" = (sensitive value)
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.s3_event_uploader_lambda will be updated in-place
  ~ resource "aws_lambda_function" "s3_event_uploader_lambda" {
      ~ filename                       = "/dojo/work/lambda/build/s3-event-uploader.zip" -> "/home/runner/work/prm-gp-registrations-mi-infra/prm-gp-registrations-mi-infra/stacks/gp-registrations-mi/terraform/../../../lambda/build/s3-event-uploader.zip"
        id                             = "dev-s3-event-uploader-lambda"
      ~ last_modified                  = "2024-01-30T14:18:07.000+0000" -> (known after apply)
      ~ runtime                        = "python3.9" -> "python3.12"
      ~ source_code_hash               = "5a6l3y8wifGyzyPeDdmfAEIm0/7q3KNwLIeNVB20txw=" -> "m/tkpMjsxvlwE/arHFg99pDDoSsCth5KVf+4XJ+PNgk="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "prm-gp-registrations-mi-infra"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-s3-event-uploader-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.splunk_cloud_event_uploader_lambda will be updated in-place
  ~ resource "aws_lambda_function" "splunk_cloud_event_uploader_lambda" {
      ~ filename                       = "/dojo/work/lambda/build/splunk-cloud-event-uploader.zip" -> "/home/runner/work/prm-gp-registrations-mi-infra/prm-gp-registrations-mi-infra/stacks/gp-registrations-mi/terraform/../../../lambda/build/splunk-cloud-event-uploader.zip"
        id                             = "dev-splunk-cloud-event-uploader-lambda"
      ~ last_modified                  = "2024-01-30T14:17:56.000+0000" -> (known after apply)
      ~ runtime                        = "python3.9" -> "python3.12"
      ~ source_code_hash               = "p7AoxclPv57fVtfhK6ihiLxB3EMVjBuOdqnui5WdA+k=" -> "JaFXLqXu4AZ/IDlkggB7w8NS5JQkQvUu8UCDCn3t3zc="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "prm-gp-registrations-mi-infra"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-splunk-cloud-event-uploader-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.event_enrichment_lambda will be created
  + resource "aws_lambda_layer_version" "event_enrichment_lambda" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_architectures    = [
          + "x86_64",
        ]
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + filename                    = "../../../lambda/build/layer/event-enrichment.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "dev-event-enrichment-lambda_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_layer_version.ods_bulk_update_lambda will be created
  + resource "aws_lambda_layer_version" "ods_bulk_update_lambda" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_architectures    = [
          + "x86_64",
        ]
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + filename                    = "../../../lambda/build/layer/event-enrichment.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "dev-ods_bulk_update_lambda_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_permission.bulk_upload_metadata_schedule_permission will be created
  + resource "aws_lambda_permission" "bulk_upload_metadata_schedule_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "dev-ods_bulk_update_lambda"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.ods_csv_files will be created
  + resource "aws_s3_bucket" "ods_csv_files" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dev-ods-csv-files"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "dev-ods-csv-files"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "dev-ods-csv-files"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_acl.ods_csv_files will be created
  + resource "aws_s3_bucket_acl" "ods_csv_files" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.mi_events_output will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "mi_events_output" {
      + bucket = "prm-gp-registrations-mi-events-dev"
      + id     = (known after apply)

      + rule {
          + id     = "expire-mi-objects-after-2-years"
          + status = "Enabled"

          + expiration {
              + days                         = 730
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # aws_s3_bucket_lifecycle_configuration.ods_csv_files will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "ods_csv_files" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "expire-ods-csv-after-3-months"
          + status = "Enabled"

          + expiration {
              + days                         = 90
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # aws_s3_bucket_ownership_controls.ods_csv_files will be created
  + resource "aws_s3_bucket_ownership_controls" "ods_csv_files" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # aws_s3_bucket_public_access_block.ods_csv_files will be created
  + resource "aws_s3_bucket_public_access_block" "ods_csv_files" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_versioning.ods_csv_files will be created
  + resource "aws_s3_bucket_versioning" "ods_csv_files" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_object.initial_gp_ods_csv will be created
  + resource "aws_s3_object" "initial_gp_ods_csv" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "init/initial-gps-ods-csv"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../scripts/initial_full_gps_ods.csv"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.initial_icb_ods_csv will be created
  + resource "aws_s3_object" "initial_icb_ods_csv" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "init/initial-icb-ods-csv"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../scripts/initial_full_icb_ods.csv"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 25 to add, 6 to change, 0 to destroy.

```

</details>